import { useState } from "react";
import FAQBox from "./FAQBox";

export default function FAQ() {
  const [openIndex, setOpenIndex] = useState(null);

  const faqs = [
    {
      question: "بوتاکس چیست و چگونه عمل می‌کند؟",
      answer:
        "بوتاکس ماده‌ای است که با شل کردن عضلات، چین‌وچروک‌های پویا را کاهش می‌دهد و باعث ظاهر جوان‌تر پوست می‌شود.",
    },
    {
      question: "تفاوت بوتاکس و فیلر چیست؟",
      answer:
        "بوتاکس عضلات را شل می‌کند و بیشتر برای خطوط دینامیک است، در حالی که فیلر حجم از دست رفته پوست را پر می‌کند و برای خطوط استاتیک کاربرد دارد.",
    },
    {
      question: "نخ‌های جوانسازی چه تاثیری دارند؟",
      answer:
        "نخ‌ها با ایجاد تحریک کلاژن‌سازی در پوست، باعث سفت شدن و لیفت صورت می‌شوند و ظاهری طبیعی و جوان‌تر به پوست می‌بخشند.",
    },
    {
      question: "لیزر درمانی برای چه مشکلاتی مناسب است؟",
      answer:
        "لیزر می‌تواند برای رفع لک‌های پوستی، جای جوش، جوانسازی و کلاژن‌سازی پوست مورد استفاده قرار گیرد.",
    },
    {
      question: "مراقبت‌های بعد از تزریق فیلر چیست؟",
      answer:
        "پرهیز از ماساژ محل تزریق، اجتناب از فعالیت‌های شدید و استفاده از کمپرس سرد به کاهش تورم و کبودی کمک می‌کند.",
    },
    {
      question: "آیا نتایج درمان با بوتاکس و فیلر دائمی است؟",
      answer:
        "نتایج معمولا بین ۶ تا ۱۸ ماه ماندگاری دارد و پس از آن نیاز به ترمیم مجدد است.",
    },
    {
      question: "محصولات مراقبتی پوست شما شامل چه مواردی است؟",
      answer:
        "محصولات شامل کرم‌ها و سرم‌های تخصصی جهت آبرسانی، ضدچروک و ترمیم پوست می‌باشند که متناسب با نیازهای مختلف پوست ارائه می‌شوند.",
    },
    {
      question: "آیا مراجعه حضوری قبل از هر درمان ضروری است؟",
      answer:
        "بله، مشاوره حضوری به تشخیص دقیق نیازهای پوست و انتخاب بهترین روش درمان کمک می‌کند.",
    },
  ];


  return <div className="flex flex-col items-center justify-center w-full gap-4 py-20 bg-secondary">
    <span className="font-bold text-3xl text-primary-dark mb-8">سوالات متداول</span>
    {faqs.map((faq , index)=>(
        <FAQBox question={faq.question}
        answer = {faq.answer}
        key={index}
        isOpen={openIndex === index}
        onToggle={()=>setOpenIndex(openIndex === index ? null : index)} />
    ))}
  </div>;
}
